// Напишите программу которая на вход принимает число и выдаёт его квадрат.

System.Console.WriteLine("Введите число:  ");
int a = Convert.ToInt32(Console.ReadLine());
System.Console.WriteLine( a*a +" ");
