// Напишите программу вычисления функции:
// x = f(a)

System.Console.WriteLine("Введите число: a  ");
int a = Convert.ToInt32(Console.ReadLine());
int x = 0;
x = a * a;
System.Console.WriteLine(" x = f(a)" + x);
